Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་རྣམས་ཀྱི་རང་རང་གི་ཁང་པ་དག་གི་སྟེང་གི་བར་སྣང་ལ་སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དེ་དག་གདུགས་རྣམས་སུ་གནས་པར་འགྱུར། སྤོས་དྲི་རྒྱ་ཆེན་པོ་ཡང་མནམ་པར་འགྱུར། ལྷའི་ཁང་པ་རྣམས་སུ་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྣང་བ་ཡང་འབྱུང་བར་འགྱུར་ཞིང་སྣང་བ་དེས་ཀྱང་ལྷའི་ཁང་པ་རྣམས་སྣང་བ་བྱས་པར་འགྱུར་རོ། །
en: A vast aroma will spread, and a golden light will appear inside those divine palaces, and that light will illuminate everything.

source: རྒྱལ་པོ་ཆེན་པོ་དག་འདི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ལྷའི་ཁང་པ་ཐམས་ཅད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་སྤོས་དང་བདུག་པའི་འཁྲི་ཤིང་དེ་དག་གདུགས་རྣམས་སུ་གནས་པ་དེ་བཞིན་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་མཆོད་པའི་ཕྱིར་མིའི་རྒྱལ་པོ་དེས་སྤོས་སྣ་ཚོགས་དེ་དག་གིས་བདུགས་མ་ཐག་ཏུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་གཟི་བརྗིད་ཀྱི་མཐུས་སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: “Mahārājas, just as parasols composed of vines of incenses and perfumes are present above all the divine palaces in the world realms in these billion world realms, in the same way, as soon as the king makes an offering of perfuming with scent The Lord King of Sūtras, the Sublime Golden Light, then through the power of the magnificence of this Lord King of Sūtras, the Sublime Golden Light there will appear vines of perfume and incense.

source: དེ་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་ཀུན་ཏུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དུ་མ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་རྣམས་སུ་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སྟེང་གི་བར་སྣང་ལ་སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་གི་གདུགས་རྣམས་སུ་གནས་པར་འགྱུར།
en: In that instant, in that moment, in that fraction of a second, parasols composed of vines of incenses and perfumes will be present in the sky above the many hundreds of thousands of quintillions of tathāgatas, as numerous as the sand grains of the Ganges River, who are in the many hundreds of thousands of quintillions of buddha realms, as numerous as the sand grains of the Ganges River, that are in the many world realms in the ten directions.

source: དེ་དག་ཀྱང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ལ་སྤོས་དང་བདུག་པ་སྣ་ཚོགས་རྒྱ་ཆེ་ཞིང་རྒྱ་ཆེ་བ་མནམ་པར་འགྱུར།
en: They will perfume many hundreds of thousands of quintillions of buddhas with an extremely vast variety of perfumes and incenses.

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྣང་བ་འབྱུང་བར་འགྱུར་ཞིང་སྣང་བ་དེས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་སྣང་བ་བྱས་པར་འགྱུར་རོ། །
en: They will shine with a golden light that will illuminate many hundreds of thousands of quintillions of buddha realms as numerous as the sand grains of the Ganges River.

source: རྒྱལ་པོ་ཆེན་པོ་དག་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་དེ་དག་བྱུང་མ་ཐག་ཏུ་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཆོས་སྨྲ་བ་དེ་ལ་དགོངས་པར་འགྱུར།
en: “Mahārājas, as soon as those miracles occur, many hundreds of thousands of quintillions of tathāgatas, as numerous as the sand grains of the Ganges River will regard that dharmabhāṇaka, and they will congratulate him, saying, ‘Well done, well done, good man!

source: སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོའི་ཚུལ་འདི་ལྟ་བུ། ཟབ་མོར་སྣང་བ་འདི་ལྟ་བུའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་དང་འདི་ལྟ་བུ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་འཆད་པར་འདོད་པ་ཁྱོད་ཡང་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པར་འགྱུར་རོ། །
en: It is excellent, excellent, that you, good man, wish to teach extensively the way of this Lord King of Sūtras, the Sublime Golden Light, which has such a profound meaning, which has such a profound illumination, and which possesses inconceivable qualities.

source: སུ་ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པའི་སེམས་ཅན་དེ་དག་ཀྱང་དགེ་བའི་རྩ་བ་ངན་ངོན་དང་ལྡན་པར་མི་འགྱུར་ན། གང་དག་འཛིན་པ་དང་། འཆང་བ་དང་། འཆད་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། འཁོར་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Any being who merely listens to this Lord King of Sūtras, the Sublime Golden Light will have merit that is not insignificant, not to mention someone who obtains it, possesses it, explains it, reads it, learns it, and teaches it extensively to an assembly.

source: སྐྱེས་བུ་དམ་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཐོས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་ཕྱིར་རོ།། །།འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: Good man, it is because on hearing this Lord King of Sūtras, the Sublime Golden Light, many hundreds of thousands of quintillions of bodhisattvas, as soon as they hear it, become irreversible in their progress toward the highest, most complete enlightenment.’

source: བམ་པོ་གསུམ་པ། དེ་ནས་ཕྱོགས་བཅུ་ཀུན་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ན་བཞུགས་པ་དག་གིས་དེའི་ཚེ་དེའི་དུས་ན། ཚིག་གཅིག་དང་ངག་གཅིག་དང་སྒྲ་སྐད་གཅིག་གིས་དགེ་སློང་ཆོས་སྨྲ་བ་ཆོས་ཀྱི་སྟན་ལ་འདུག་པ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་མ་འོངས་པའི་དུས་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་འགྱུར།
en: “Then, at that time, in that time, the many hundreds of thousands of quintillions of tathāgatas in many hundreds of thousands of quintillions of buddha realms, as numerous as the sand grains of the Ganges River, in the same words, in one voice, as one speech, will say to the dharmabhāṇaka bhikṣu who is seated on the Dharma throne, ‘Good man, in a future time you will go to the Bodhimaṇḍa.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་སོང་སྟེ། ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་འདུག་ནས་འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ། སེམས་ཅན་ཐམས་ཅད་ལས་རབ་ཏུ་འདས་པའི་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་སྤྱོད་པའི་སྟོབས་བསྐྱེད་པའི་བྱིན་གྱིས་བརླབས་དཀའ་བ་སྤྱོད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་སྟོན་པར་འགྱུར།
en: “ ‘Good man, when you have gone to the supreme, sublime Bodhimaṇḍa, you will sit at the foot of the king of trees, and you will manifest performing with determination many hundreds of thousands of quintillions of disciplines and ascetic practices that are superior to all the three worlds and transcend all beings.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལེགས་པར་བརྒྱན་པར་བྱེད་པར་འགྱུར།
en: “ ‘Good man, you will perfectly adorn the Bodhimaṇḍa.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར།
en: “ ‘Good man, you will protect all the world realms of a billion worlds.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་འདུག་སྟེ་བདུད་ཀྱི་སྡེ་བསམ་གྱིས་མི་ཁྱབ་པ། གཟུགས་རབ་ཏུ་འཇིགས་འཇིགས་ལྟར་འདུག་པ་མི་སྡུག་པ་སྟོན་པ། གཟུགས་མི་སྡུག་པ་སྣ་ཚོགས་དག་ལས་རྒྱལ་བར་འགྱུར།
en: “ ‘Good man, at the foot of the king of trees, you will be victorious over the innumerable armies of Māra, who have terrifying forms, terrifying presence, hideous manifestations, and various hideous forms.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་སོང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དཔེ་མེད་པ་རབ་ཏུ་ཞི་བ་རྡུལ་དང་བྲལ་བ་ཟབ་མོ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: “ ‘Good man, having gone to the supreme, sublime Bodhimaṇḍa, you will attain the highest, most complete enlightenment of complete buddhahood that is beyond analogy and is complete peace, spotless, and profound.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་རྡོ་རྗེའི་གདན་སྙིང་པོ་བརྟན་པ་ལ་འདུག་སྟེ།
en: “ ‘Good man, you will be seated upon the central, eternal vajra seat.

source: ཆོས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ཐམས་ཅད་ཀྱིས་མངོན་པར་བསྟོད་པ། མཆོག་ཏུ་ཟབ་པ་བླ་ན་མེད་པ་རྣམ་པ་བཅུ་གཉིས་རབ་ཏུ་བསྐོར་བར་འགྱུར།
en: You will turn the Dharma wheel that is praised by all the jinas, is supremely profound, and has the twelve forms.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཆོས་ཀྱི་རྔ་ཆེན་པོ་བླ་ན་མེད་པ་རྡུང་བར་འགྱུར།
en: “ ‘Good man, you will beat the unsurpassable great drum of the Dharma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཆོས་ཀྱི་དུང་བླ་ན་མེད་པ་འབུད་པར་འགྱུར།
en: “ ‘Good man, you will blow the unsurpassable conch of the Dharma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཆོས་ཀྱི་རྒྱལ་མཚན་ཆེན་པོ་བསྒྲེང་བར་འགྱུར།
en: “ ‘Good man, you will raise the great banner of the Dharma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཆོས་ཀྱི་སྒྲོན་མ་བླ་ན་མེད་པ་འབར་བར་བྱེད་པར་འགྱུར།
en: “ ‘Good man, you will light the unsurpassable lamp of the Dharma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཆོས་ཀྱི་ཆར་བླ་ན་མེད་པ་འབེབས་པར་འགྱུར།
en: “ ‘Good man, you will send down the unsurpassable rain of the Dharma.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཉོན་མོངས་པའི་དགྲ་སྟོང་ཕྲག་དུ་མ་ལས་རྒྱལ་བར་འགྱུར།
en: “ ‘Good man, you will be victorious over many thousands of kleśa enemies.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཤིན་ཏུ་འཇིགས་སུ་རུང་བ་འཇིགས་པ་ཆེན་པོའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་འགྱུར།
en: “ ‘Good man, you will free many hundreds of thousands of quintillions of beings from the terrifying ocean of great terrors.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་འཁོར་བའི་འཁོར་ལོ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པར་འགྱུར།
en: “ ‘Good man, you will free many hundreds of thousands of quintillions of beings from the wheel of saṃsāra.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་མཉེས་པར་བྱེད་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: “ ‘Good man, you will please many hundreds of thousands of quintillions of buddhas.’ ”

source: བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོའི་ཡོན་ཏན་ཚེ་འདི་དང་མ་འོངས་པ་ན་འབྱུང་བ་འདི་ལྟ་བུ་འདི་དག་མཐོང་བ་སངས་རྒྱས་སྟོང་ཕྲག་བརྒྱ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མ་མཆིས་པ་ཡོངས་སུ་འཛིན་པར་མཐོང་ནས་སྙིང་བརྩེ་བའི་སླད་དུ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རང་རང་གི་ཁང་པ་ན་མཆིས་པ་དག་སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་གི་གདུགས་ཀྱིས་བསྐུལ་མ་ཐག་ཏུ་ལུས་མི་གདའ་བར་བགྱིས་ཏེ། མིའི་རྒྱལ་པོ་དེ་ཁང་པ་བརྩེགས་པ་ཕྱག་དར་མ་མཆིས་པ་ལེགས་པར་ཕྱག་དར་བགྱིས་པ། སྤོས་ཆབ་སྣ་ཚོགས་ཀྱིས་ཆག་ཆག་ལེགས་པར་བཏབ་པ། རྒྱན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པའི་རྒྱལ་པོའི་ཕོ་བྲང་ག་ལ་བ་དེར་ཆོས་མཉན་པའི་སླད་དུ་མཆི་བར་བགྱིའོ། །མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་དང་། ལྷ་མོ་ཆེན་མོ་དཔལ་དང་། སའི་ལྷ་མོ་བརྟན་མ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་དང་།
en: When the Bhagavat had said that, the Four Mahārājas said to him, “Venerable Bhagavat, when we see a human king who has developed roots of merit with a hundred thousand buddhas, who possesses an incalculable aggregation of merit, and who sees these qualities that arise in this life and the future from this Lord King of Sūtras, the Sublime Golden Light, then, venerable Bhagavat, out of kindness for him, when we, the Four Mahārājas, and our army, attendants, and many hundreds of thousands of yakṣas, are invoked by the vines of various perfumes and incenses at each of our dwellings, we will immediately, in order to listen to the Dharma, make our bodies invisible and will go to the king’s palace, which has been well swept, excellently sprinkled with various perfumes, and excellently adorned with various decorations.

source: གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ནོར་བུ་བཟང་དང་། འཕྲོག་མའི་བུ་ལྔ་བརྒྱའི་འཁོར་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་ལུས་མི་གདའ་བར་བགྱིས་ཏེ།
en: Brahmā, the lord of Sahā; Śakra, the lord of the devas; the great goddess Sarasvatī; the great goddess Śrī; the great goddess Dṛḍhā; the great yakṣa general Saṃjñeya; the twenty-eight great yakṣa generals; the deity Maheśvara; the great yakṣa general Vajrapāṇi; the great yakṣa general Māṇibhadra; Hārītī with her entourage of five hundred children; the nāga king Anavatapta; the nāga king Sāgara; and many hundreds of thousands of quintillions of devas, with their bodies invisible, will come to the human king’s palace, which has been adorned with various decorations.

source: མིའི་རྒྱལ་པོ་དེའི་ཕོ་བྲང་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ག་ལ་བ་དང་། ཆོས་སྨྲ་བ་དེའི་ཆོས་ཀྱི་ཁྲི་མཐོན་པོ་རྒྱན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པ། མེ་ཏོག་བཀྲམ་པའི་ས་ལ་བཤམས་པར་འགྱུར་བ་ག་ལ་བ་དེར་ཆོས་མཉན་པའི་སླད་དུ་མཆི་བར་བགྱིའོ། །
en: In order to listen to the Dharma, they will come to the dharmabhāṇaka’s high Dharma throne, which has been perfectly adorned with various adornments and set up on a floor that has been scattered with flowers.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དེ་དག་ཐམས་ཅད་མཐུན་པར་བགྱིས་ཏེ་མིའི་རྒྱལ་པོ་དགེ་བའི་གྲོགས་བགྱིད་པ། དགེ་བ་འཐོབ་པར་བགྱིད་པ། བླ་ན་མེད་པ་ཆོས་ཀྱི་སྦྱིན་པ་ཆེན་པོ་སྦྱིན་པ་དེ་ལ། ཆོས་ཀྱི་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་གྱུར་མ་ཐག་ཏུ།
en: “Venerable Bhagavat, we, the Four Mahārājas, and our army, attendants, and many hundreds of thousands of yakṣas, all in unison, as soon as we have been satiated by the liquid amṛta of the Dharma, will become guardians of that human king, the human king who is aided by a kalyāṇamitra, who has accomplished goodness, and who makes the vast gift of the unsurpassable Dharma.

source: མིའི་རྒྱལ་པོ་དེ་ལ་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །
en: We will defend him, keep him in our care, protect him, and bring him peace and well-being.

source: རྒྱལ་པོའི་ཕོ་བྲང་དེ་དང་གྲོང་ཁྱེར་དེ་དང་ཡུལ་དེ་ཡང་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །
en: We will guard, defend, keep in our care, protect, and bring peace and well-being to that royal palace, that city, and that domain.

source: ཆད་པ་སྤང་བར་ཡང་བགྱིའོ། །
en: We will save them from attack.

source: ཡུལ་དེ་ཡང་འཇིགས་པ་དང་གནོད་པ་དང་ནད་འགོ་བ་དང་འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་མིའི་རྒྱལ་པོར་གྱུར་ཏེ། མིའི་རྒྱལ་པོ་དེའི་ཡུལ་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་བྱུང་ལ།
en: We will free those in that domain from all fear, harm, disease, and disturbances.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་དེ་དགེ་སློང་དང་དགེ་སློང་མའམ་དགེ་བསྙེན་ནམ་དགེ་བསྙེན་མ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛིན་པ་དག་ལ་བསྟི་སྟང་མི་བགྱིད། བླ་མར་མི་བགྱིད། རིམ་གྲོ་མི་བགྱིད། མཆོད་པ་མི་བགྱིད་ན། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཆོས་ཉན་པ་འདི་དང་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་མི་བགྱིད།
en: “Venerable Bhagavat, when someone is a human king and in that human king’s domain there appears The Lord King of Sūtras, the Sublime Golden Light, then, venerable Bhagavat, if that human king does not honor, venerate, worship, and make offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess The Lord King of Sūtras, the Sublime Golden Light, and we, the Four Mahārājas, and our army, attendants, and many hundreds of thousands of yakṣas, are not satiated by hearing this Dharma and by the liquid amṛta of the Dharma, and are not worshiped, then the brilliance of our bodies will not increase.

source: རིམ་གྲོ་མི་བགྱིད། ལྷའི་ལུས་འདི་དག་གི་གཟི་ཡང་རྣམ་པར་འཕེལ་བར་མི་བགྱིད། བདག་ཅག་གི་བརྩོན་འགྲུས་དང་མཐུ་དང་སྟོབས་ཀྱང་མི་བསྐྱེད། བདག་ཅག་གི་ལུས་ལ་གཟི་བརྗིད་དང་དཔལ་དང་ཕུན་སུམ་ཚོགས་པ་ཡང་རྣམ་པར་འཕེལ་བར་མི་བགྱིད་དོ། །
en: Our diligence, power, and might will not develop, and magnificence, splendor, and good fortune will not increase within our bodies.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་དང་། གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་གིས་ཡུལ་དེ་ཡལ་བར་དོར་བར་བགྱིའོ། །
en: “Venerable Bhagavat, we, the Four Mahārājas, and our army, attendants, and many hundreds of thousands of yakṣas, will abandon that domain.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཡུལ་དེ་ཡལ་བར་བོར་ན་ཡུལ་ན་གནས་པའི་ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡུལ་དེ་ཡལ་བར་འདོར་བར་འགྱུར་རོ། །
en: “Venerable Bhagavat, if we abandon that domain, all the devas who dwell in that domain will also abandon it.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ལྷ་རྣམས་ཀྱིས་ཡུལ་དེ་ཡལ་བར་བོར་ན་ཡུལ་དེར་ཡུལ་རྣམ་པར་འཁྲུག་པ་སྣ་ཚོགས་འབྱུང་བར་འགྱུར།
en: “Venerable Bhagavat, if the devas abandon that domain, there will various kinds of troubles in that domain.

source: རྒྱལ་པོའི་འཁྲུག་པ་མི་བཟད་པ་དག་འབྱུང་བར་འགྱུར།
en: There will be terrible troubles for the king.

source: ཡུལ་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་འཐབ་པ་སྐྱེ་བ་དང་མཚང་འདྲུ་བ་སྐྱེ་བ་དང་རྩོད་པ་སྐྱེ་བར་འགྱུར།
en: All the beings who dwell in that domain will become belligerent, quarrelsome, contentious, and disputatious.

source: རྫོགས་པ་དང་འགྱེད་པར་འགྱུར་བ་དང་གཟའ་དང་ནད་རྣམ་པ་སྣ་ཚོགས་ཡུལ་དུ་འབྱུང་བར་འགྱུར།
en: Various malign planetary influences and illnesses will occur.

source: ཕྱོགས་ཐ་དད་པ་ནས་སྐར་མདའ་ལྟུང་བར་འགྱུར།
en: Shooting stars will fall from every direction.

source: གཟའ་དང་རྒྱུ་སྐར་རྣམས་ཀྱང་ཕན་ཚུན་མི་མཐུན་པར་གདའ་བར་འགྱུར།
en: The planets and lunar asterisms will be in disharmony.

source: དགུང་ཟླ་འཆར་བ་དེའང་ཉི་མ་ལྟ་བུར་གདའ་བར་འགྱུར།
en: The moon will pass through the sky as if it is the sun.

source: ཟླ་བའི་གཟའ་དང་ཉི་མའི་གཟའ་འབྱུང་བར་འགྱུར། ཉི་མ་དང་ཟླ་བ་ནམ་མཁའ་ལ་གནས་པ་ཡང་རྟག་པར་རྒྱུན་དུ་སྒྲ་གཅན་གྱི་གནོད་པ་དང་ལྡན་པར་འགྱུར།
en: Though the moon and sun will be in the sky, eclipses will continually obscure them.

source: དུས་དུས་སུ་ནམ་མཁའ་ལ་འཇའི་ཁ་དོག་ལྟ་བུ་འཁྱིལ་བར་འགྱུར།
en: From time to time there will be swirling rainbow colors in the sky.

source: ས་ཡང་གཡོ་བར་འགྱུར།
en: The ground will shake.

source: ས་ལ་གནས་པའི་ཁྲོན་པ་ཡང་སྒྲ་འབྱིན་པར་གྲག་པར་འགྱུར།
en: Cavities in the ground will emit sounds.

source: ཡུལ་དུ་རླུང་དྲག་པོ་ལྡང་བར་འགྱུར།
en: A fierce wind will arise in the domain.

source: ཆར་དྲག་པོ་འབབ་པར་འགྱུར།
en: A fierce rain will fall.

source: ཡུལ་དུ་མུ་གེའི་དགོན་པ་འབྱུང་བར་འགྱུར།
en: There will be the calamity of famine.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་ཡུལ་འཇོམས་པར་འགྱུར། ཡུལ་དེ་ཕུང་བར་འགྱུར།
en: The country will be defeated by an enemy army and ruined.

source: སེམས་ཅན་དེ་དག་ཀྱང་ཉོན་མོངས་པ་མང་བར་འགྱུར།
en: The beings there will suffer many troubles.

source: ཡུལ་དེ་ཉམས་མི་དགའ་བར་འགྱུར་རོ། །
en: That domain will experience unhappiness.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ཡུལ་ན་གནས་པའི་ལྷ་དང་ཀླུ་རྣམས་ཀྱིས་ཡུལ་དེ་ཡལ་བར་བོར་ན། ཡུལ་དེར་འདི་ལྟ་བུའི་གནོད་པ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་དང་གནོད་པ་སྣ་ཚོགས་སྟོང་འབྱུང་བར་འགྱུར་རོ། །
en: “Venerable Bhagavat, if we, the Four Mahārājas, and our army, attendants, and many hundreds of thousands of yakṣas, along with that domain’s devas and nāgas, abandon that domain, there will be hundreds of such calamities, thousands of such various calamities.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་མིའི་རྒྱལ་པོར་གྱུར་ལ། དེ་བདག་ཉིད་ལ་ཀུན་ཏུ་བསྲུང་བ་ཆེན་པོ་བགྱིད་འཚལ་བར་འགྱུར། རྒྱལ་པོའི་བདེ་བ་སྣ་ཚོགས་ཡུན་རིང་པོར་མྱོང་བར་འཚལ་བར་འགྱུར། བདེ་བ་ཐམས་ཅད་བསྟབས་པའི་སེམས་ཀྱིས་རྒྱལ་པོ་ཉིད་བགྱིད་འཚལ་བར་འགྱུར། ཡུལ་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བགྱིད་འཚལ་བར་འགྱུར། ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་ཕམ་པར་བགྱིད་འཚལ་བར་འགྱུར། ཡུལ་ཐམས་ཅད་ཡུན་རིང་དུ་ཡོངས་སུ་སྐྱོང་འཚལ་བར་འགྱུར། ཆོས་ཀྱི་རྒྱལ་པོ་ཉིད་བགྱིད་འཚལ་བར་འགྱུར། རང་གི་ཡུལ་ཡང་འཇིགས་པ་དང་གནོད་པ་དང་ནད་འགོ་བ་དང་འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་འཚལ་བར་འགྱུར་ན།
en: “Venerable Bhagavat, if there is a human king who wishes to be well guarded; who wishes to experience the various joys of a king for a long time; who wishes to enjoy for a long time the pleasures of being a king; who wishes to make all the beings who dwell in his domain happy; who wishes to defeat all the armies of his adversaries; who wishes to protect his entire domain for a long time; who wishes to be a Dharma king; and who wishes to free his domain from all fear, harm, disease, and disturbances, then, venerable Bhagavat, that human king should listen with conviction to this Lord King of Sūtras, the Sublime Golden Light.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་དེས་གདོན་མི་འཚལ་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པར་བགྱི། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འཛིན་པ་དེ་དག་ལ་ཡང་བསྟི་སྟང་བགྱི།
en: He should honor, venerate, worship, and make offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess The Lord King of Sūtras, the Sublime Golden Light.

source: བླ་མར་བགྱི། རིམ་གྲོ་བགྱི། མཆོད་པ་བགྱི། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་རྣམས་ཀྱང་ཆོས་མཉན་པའི་དགེ་བའི་རྩ་བ་བསགས་པ་འདི་དང་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་བགྱི།
en: We, the Four Mahārājas, and our army and attendants should become satisfied by this accumulation of the roots of merit through listening to the Dharma and by this liquid amṛta of the Dharma.

source: བདག་ཅག་གི་ལྷའི་ལུས་འདི་དག་གི་གཟི་ཆེན་པོ་ཡང་རྣམ་པར་འཕེལ་བར་བགྱིའོ། །
en: The great brilliance of these divine bodies of ours should be increased.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་དེས་གདོན་མི་འཚལ་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པར་བགྱི་སྟེ།
en: Venerable Bhagavat, the human king should listen with conviction to this Lord King of Sūtras, the Sublime Golden Light.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཚངས་པའི་དབང་པོས་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བསྟན་བཅོས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་བསྟན་པ་དག་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསྟན་བཅོས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་བསྟན་པ་དག་དང་། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཅན་རྣམ་པ་སྣ་ཚོགས་དག་གིས་སེམས་ཅན་དག་གི་དོན་གྱི་སླད་དུ་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བསྟན་བཅོས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་བསྟན་པ་དག་ལས་ཆེས་མཆོག་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ནི།
en: “Venerable Bhagavat, this Lord King of Sūtras, the Sublime Golden Light is much greater than, far superior to, all the various worldly and nonworldly treatises taught by the lord of Brahmās; all the various treatises taught by Śakra, the lord of the devas; and all the various worldly and nonworldly treatises taught for the benefit of beings by ṛṣis who possessed the five higher cognitions.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཚངས་པའི་དབང་པོ་བརྒྱ་ཕྲག་སྟོང་དེ་དག་དང་བརྒྱ་བྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ཐམས་ཅད་པས་ཆེས་མཆོག་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་སླད་དུ་རྒྱ་ཆེར་ཡང་དག་པར་བཤད་པ་ལགས་སོ། །ཇི་ལྟར་ན་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་གནས་པའི་མི་རྣམས་ཀྱི་རྒྱལ་པོས་རྒྱལ་པོ་ཉིད་བགྱི་བ་དང་། ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་འགྱུར་བ་དང་། ཇི་ལྟར་རང་གི་ཡུལ་ཀུན་ཏུ་བསྲུངས་པར་འགྱུར་བ་དང་། ཡོངས་སུ་བསྐྱངས་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཡུལ་ཐམས་ཅད་ན་གནོད་པ་དང་དགྲ་མ་མཆིས་པར་འགྱུར་བ་དང་།
en: “Venerable Bhagavat, a tathāgata is much greater than, far superior to, a hundred thousand lords of the Brahmās, the many hundreds of thousands of quintillions of Śakras, and all the hundreds of thousands of quintillions of ṛṣis endowed with the five higher cognitions, and he teaches extensively this Lord King of Sūtras, the Sublime Golden Light in order to benefit beings.

source: ཇི་ལྟར་ཕ་རོལ་གྱི་དམག་ཚོགས་རྣམས་ཕམ་སྟེ་ཕྱིར་ཕྱོགས་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཡུལ་དེ་དག་ན་ནད་འགོ་བ་མ་མཆིས་ཤིང་འཁྲུག་པ་མ་མཆིས་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཡུལ་ཐམས་ཅད་ཆོས་ཀྱིས་འཁྲུག་པ་མ་མཆིས་ཤིང་མི་རྫི་བར་འགྱུར་བ་དང་། ཇི་ལྟར་མིའི་རྒྱལ་པོ་དེ་དག་གིས་རང་རང་གི་ཡུལ་རྣམས་སུ་ཆོས་ཀྱི་སྒྲོན་མ་ཆེན་པོ་འབར་བར་བགྱིས་ཤིང་སྣང་བར་བགྱིས་པར་འགྱུར་བ་དང་།
en: “The bhagavat arhat samyaksaṃbuddha has the blessing of the power of great compassion, which is far superior to that of a hundred thousand quintillion lords of the Brahmās; he has a tathāgata’s unsurpassable wisdom, which is far superior to the divine knowledge of a hundred thousand quintillion Śakras; and he has a blessing that is far superior to that of all the many hundreds of thousands of quintillions of ṛṣis who have the various forms of the five higher cognitions.
